Revit 2026 API

# ExternalResourceReferenceGetResourceVersionStatus Method

---

Checks whether this ExternalResourceReference corresponds to the current version of the resource.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ResourceVersionStatus GetResourceVersionStatus()
```
```vb
Public Function GetResourceVersionStatus As ResourceVersionStatus
```
```cpp
public:
ResourceVersionStatus GetResourceVersionStatus()
```
```fsharp
member GetResourceVersionStatus : unit -> ResourceVersionStatus
```

#### Return Value

ResourceVersionStatus An enum indicating whether this reference represents the most recent version of the resource.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The server referenced by the ExternalResourceReference does not exist or does not implement IExternalResourceServer. |

This method should only be called if the ExternalResourceServer that provides the resource is present.

#### Reference

ExternalResourceReference Class

Autodesk.Revit.DB Namespace